-- 融资融券
-- drop table eastmoney_stock_rzrq;
create table eastmoney_stock_rzrq_json
(
"rzrq_data" jsonb
);

-- 报表预约披露时间
create table eastmoney_stock_bbsj
(
"symbol" char(8),
"code" char(6),
"yuyue_date" date,
"pilu_date" date,
"finance_date" date
);


-- 融资融券余额差值
select rzrq_data->'rzrqyecz' from eastmoney_stock_rzrq_json
where rzrq_data->>'tdate' = '2017-10-19T00:00:00';
-- 
select (rzrq_data->>'tdate')::date "交易日期",rzrq_data->'rzrqyecz' "融资融券余额差值" 
from eastmoney_stock_rzrq_json
where rzrq_data->>'scode' = '600104'
order by rzrq_data->>'tdate' desc;
--
select (e.rzrq_data->>'tdate')::date "date", e.rzrq_data->'rzrqyecz' "rzrqyecz", x.close
from eastmoney_stock_rzrq_json e left join xueqiu_stock_day_fq x
on (e.rzrq_data->>'scode' = substr(x.symbol,3) and (e.rzrq_data->>'tdate')::date = x.date)
where rzrq_data->>'scode' = '002142'
order by rzrq_data->>'tdate' desc;

-- 
delete from eastmoney_stock_rzrq_json
where rzrq_data->>'scode' in ('510900', '601166', '601318', '000725', '601668', '600016', '600030', '002230', '600516', '000413', '600000', '002450', '600340', '300104', '601688', '600519', '601398', '000001', '600036', '000776', '600383', '000728', '600100', '600570', '002340', '600606', '600260', '600048', '601099', '600522', '000100', '600887', '000050', '601288', '601328', '601377', '601788', '000917', '600489', '300024', '300070', '601818', '600150', '002407', '000002', '300077', '600518', '600490', '000401', '002500', '601169', '000778', '002008', '600104', '601390', '000938', '600125', '601238', '600176', '300079', '600895', '000157', '002067', '601998', '601336', '600827', '002292', '600777', '000598', '600312', '600183', '600116', '002055', '600874', '000969', '601601', '000718', '300199', '600751', '300251', '600037', '600422', '000031', '000877', '002701', '603000', '000572', '601155', '000563', '600652', '002396', '002004', '600018', '000551', '002029', '600692', '600300', '600801', '601866', '600107', '002399', '002095', '002051', '600449', '600470', '600664', '002294', '600604', '600741', '600061', '600743', '000506', '600835', '300191', '600730', '002140', '002646', '000883', '002242', '600802', '601880', '600855', '000869', '601996', '002204', '600761', '000732', '600600', '512070');
